benchmarks/logs/2026-04-30_post_loop_liveness/burst_get_bookmarks.txt
Running 30s test @ http://localhost:8080/bookmarks
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.05ms    1.09ms   8.46ms   72.96%
    Req/Sec     2.49k   278.16     2.90k    52.67%
  Latency Distribution
     50%    2.13ms
     75%    2.47ms
     90%    3.06ms
     99%    5.00ms
  148793 requests in 30.02s, 1.57GB read
Requests/sec:   4956.03
Transfer/sec:     53.55MB