benchmarks/logs/2026-04-30_post_loop_liveness/soak_get_bookmarks.txt
Running 5m test @ http://localhost:8080/bookmarks
  1 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   804.50us  426.09us   5.59ms   62.88%
    Req/Sec     5.02k    86.32     5.28k    66.91%
  Latency Distribution
     50%  764.00us
     75%    1.13ms
     90%    1.43ms
     99%    1.79ms
  1499549 requests in 5.00m, 15.82GB read
Requests/sec:   4996.81
Transfer/sec:     53.99MB